renesas/ArduinoCore-rl78g23_fpb_64p/variants/g23-fpb-64p/variant.h
/*
  Copyright (c) 2014-2016 Arduino LLC.  All right reserved.

  This library is free software; you can redistribute it and/or
  modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation; either
  version 2.1 of the License, or (at your option) any later version.

  This library is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
  See the GNU Lesser General Public License for more details.

  You should have received a copy of the GNU Lesser General Public
  License along with this library; if not, write to the Free Software
  Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA
*/

#ifndef _VARIANT_H_
#define _VARIANT_H_

/*----------------------------------------------------------------------------
 *        Definitions
 *----------------------------------------------------------------------------*/

/*----------------------------------------------------------------------------
 *        Headers
 *----------------------------------------------------------------------------*/
#include <stdint.h>
#include <stdlib.h>

#ifdef __cplusplus
#endif // __cplusplus

#ifdef __cplusplus
extern "C"
{

}
#endif // __cplusplus

/*----------------------------------------------------------------------------
 *        Pins
 *----------------------------------------------------------------------------*/

#define NUM_DIGITAL_PINS            57
#define NUM_ANALOG_INPUTS           10
#define NUM_SWPWM_PINS              4
// #endif
#define analogInputToDigitalPin(p)  ((p < 6) ? (p) + 14 : -1)

#define digitalPinHasPWM(p)         ((p) == 5 || (p) == 6 || (p) == 10 || (p) == 32)


#define PIN_SPI_SS    (10)
#define PIN_SPI_MOSI  (36)
#define PIN_SPI_MISO  (37)
#define PIN_SPI_SCK   (38)

#define PIN_SPI3_SS    (27)
#define PIN_SPI3_MOSI  (11)
#define PIN_SPI3_MISO  (12)
#define PIN_SPI3_SCK   (13)

#define PIN_SPI4_SS    (27)
#define PIN_SPI4_MOSI  (35)
#define PIN_SPI4_MISO  (34)
#define PIN_SPI4_SCK   (33)

#define PIN_SPI5_SS    (27)
#define PIN_SPI5_MOSI  (21)
#define PIN_SPI5_MISO  (20)
#define PIN_SPI5_SCK   (19)
// 2023/02/20
extern const uint8_t SS;
extern const uint8_t MOSI;
extern const uint8_t MISO;
extern const uint8_t SCK;

extern const uint8_t SS3;
extern const uint8_t MOSI3;
extern const uint8_t MISO3;
extern const uint8_t SCK3;

extern const uint8_t SS4;
extern const uint8_t MOSI4;
extern const uint8_t MISO4;
extern const uint8_t SCK4;

extern const uint8_t SS5;
extern const uint8_t MOSI5;
extern const uint8_t MISO5;
extern const uint8_t SCK5;
#define PIN_WIRE_SDA0        (48) // P61
#define PIN_WIRE_SCL0        (47) // P60
#define PIN_WIRE_SDA1        (50) // P63
#define PIN_WIRE_SCL1        (49) // P62

#define PIN_WIRE_SDA0_MASK   0x02 // P61
#define PIN_WIRE_SCL0_MASK   0x01 // P60
#define PIN_WIRE_SDA1_MASK   0x08 // P63
#define PIN_WIRE_SCL1_MASK   0x04 // P62
// 2023/02/20
extern const uint8_t SDA0;
extern const uint8_t SCL0;
extern const uint8_t SDA1;
extern const uint8_t SCL1;
#define BUILTIN_LED1 16
#define BUILTIN_LED2 15
#define LED_BUILTIN  BUILTIN_LED1

#define LED_ON  LOW
#define LED_OFF HIGH

#define PIN_A0   (51)	/*A0 = ANI2 */
#define PIN_A1   (52)	/*A1 = ANI3 */
#define PIN_A2   (53)	/*A2 = ANI4 */
#define PIN_A3   (54)	/*A3 = ANI5 */
#define PIN_A4   (55)	/*A4 = ANI6 */
#define PIN_A5   (56)	/*A5 = ANI7 */
#define PIN_A6	(0)		/* ANI16(P03/RxD1) */
#define PIN_A7	(1)		/* ANI17(P02/TxD1) */
#define PIN_A8	(29)	/* ANI19(P120) (DIGITAL_PIN_29) */
#define PIN_A9	(40)	/* ANI18(P147) (DIGITAL_PIN_40) */
// 2023/02/20
extern const uint8_t A0;
extern const uint8_t A1;
extern const uint8_t A2;
extern const uint8_t A3;
extern const uint8_t A4;
extern const uint8_t A5;
extern const uint8_t A6;
extern const uint8_t A7;
extern const uint8_t A8;
extern const uint8_t A9;

#define digitalPinToInterrupt(p)  (((p) == 4) ? 0 : (((p) == 6) ? 1 : (((p) == 7) ? 2 : (((p) == 11) ? 3 : (((p) == 12) ? 4 : (((p) == 13) ? 5 : (((p) == 26) ? 6 : NOT_AN_INTERRUPT)))))))

#ifdef __RL78__
/***************************************************************************/
/*    Macro Definitions                                                    */
/***************************************************************************/
#define ADDR_PORT_REG			0xFFFFFF00
#define ADDR_PORT_MODE_REG		0xFFFFFF20
#define ADDR_PORT_PULL_UP_REG	0xFFFF0030
#define	ADDR_PORT_IN_MODE_REG	0xFFFF0040
#define ADDR_PORT_OUT_MODE_REG	0xFFFF0050

/* Add for G23 */
#define ADDR_PORT_MODE_CONTROL_A_REG	0xFFFF0060
#define ADDR_PORT_MODE_CONTROL_T_REG	0xFFFF0260
#define ADDR_PORT_MODE_CONTROL_E_REG	0xFFFF0280
#define ADDR_PORT_OUT_CUR_CONTROL_REG	0xFFFF02A8
#define ADDR_PORT_DIG_INPUT_DIS_REG		0xFFFF02B0
/* Add for G23 */

#define ANALOG_PIN_0		2		// ANI2 (DIGITAL_PIN_51)
#define ANALOG_PIN_1		3		// ANI3 (DIGITAL_PIN_52)
#define ANALOG_PIN_2		4		// ANI4 (DIGITAL_PIN_53)
#define ANALOG_PIN_3		5		// ANI5 (DIGITAL_PIN_54)
#define ANALOG_PIN_4		6		// ANI6 (DIGITAL_PIN_55)
#define ANALOG_PIN_5		7		// ANI7 (DIGITAL_PIN_56)
/* add 2021.07.29 */
#define ANALOG_PIN_6		16		// ANI16(P03/RxD1) (DIGITAL_PIN_0)
#define ANALOG_PIN_7		17		// ANI17(P02/TxD1) (DIGITAL_PIN_1)
#define ANALOG_PIN_8		19		// ANI19(P120) (DIGITAL_PIN_29)
#define ANALOG_PIN_9		18		// ANI18(P147) (DIGITAL_PIN_40)

/* Port define. */
#define PORT_0				0
#define PORT_1				1
#define PORT_2				2
#define PORT_3				3
#define PORT_4				4
#define PORT_5				5
#define PORT_6				6
#define PORT_7				7
#define PORT_8				8
#define PORT_9				9
#define PORT_10				10
#define PORT_11				11
#define PORT_12				12
#define PORT_13				13
#define PORT_14				14
#define PORT_15				15

/* Port of digital pin define. */
#define DIGITAL_PIN_0		PORT_0	/* P03	*/
#define DIGITAL_PIN_1		PORT_0	/* P02	*/
#define DIGITAL_PIN_2		PORT_4	/* P43	*/
#define DIGITAL_PIN_3		PORT_4	/* P42	*/
#define DIGITAL_PIN_4		PORT_7	/* P77	*/
#define DIGITAL_PIN_5		PORT_4	/* P41	*/
#define DIGITAL_PIN_6		PORT_3	/* P31	*/
#define DIGITAL_PIN_7		PORT_7	/* P76	*/
#define DIGITAL_PIN_8		PORT_7	/* P73	*/
#define DIGITAL_PIN_9		PORT_0	/* P06	*/
#define DIGITAL_PIN_10		PORT_0	/* P05	*/
#define DIGITAL_PIN_11		PORT_5	/* P51	*/
#define DIGITAL_PIN_12		PORT_5	/* P50	*/
#define DIGITAL_PIN_13		PORT_3	/* P30	*/
#define DIGITAL_PIN_14		PORT_2	/* P40(REF)	*/ // P20->P40
#define DIGITAL_PIN_15		PORT_5	/* P52	*/
#define DIGITAL_PIN_16		PORT_5	/* P53	*/
#define DIGITAL_PIN_17		PORT_5	/* P54	*/
#define DIGITAL_PIN_18		PORT_5	/* P55	*/
#define DIGITAL_PIN_19		PORT_7	/* P70	*/
#define DIGITAL_PIN_20		PORT_7	/* P71	*/
#define DIGITAL_PIN_21		PORT_7	/* P72	*/
#define DIGITAL_PIN_22		PORT_7	/* P74	*/
#define DIGITAL_PIN_23		PORT_7	/* P75	*/
#define DIGITAL_PIN_24		PORT_12	/* P121	*/
#define DIGITAL_PIN_25		PORT_12	/* P122	*/
#define DIGITAL_PIN_26		PORT_13	/* P137	*/
#define DIGITAL_PIN_27		PORT_12	/* P123	*/
#define DIGITAL_PIN_28		PORT_12	/* P124	*/
#define DIGITAL_PIN_29		PORT_12	/* P120	*/
#define DIGITAL_PIN_30		PORT_0	/* P04 	*/

