renesas/ArduinoCore-rl78g23_fpb_64p/variants/g23-fpb-64p/variant.h
#define DIGITAL_PIN_31		PORT_1	/* P17	*/
#define DIGITAL_PIN_32		PORT_1	/* P16	*/
#define DIGITAL_PIN_33		PORT_1	/* P15	*/
#define DIGITAL_PIN_34		PORT_1	/* P14	*/
#define DIGITAL_PIN_35		PORT_1	/* P13	*/
#define DIGITAL_PIN_36		PORT_1	/* P12	*/
#define DIGITAL_PIN_37		PORT_1	/* P11	*/
#define DIGITAL_PIN_38		PORT_1	/* P10	*/
#define DIGITAL_PIN_39		PORT_14	/* P146	*/
#define DIGITAL_PIN_40		PORT_14	/* P147	*/
#define DIGITAL_PIN_41		PORT_2	/* P21 	*/
#define DIGITAL_PIN_42		PORT_13	/* P130	*/
#define DIGITAL_PIN_43		PORT_0	/* P01 	*/
#define DIGITAL_PIN_44		PORT_0	/* P00 	*/
#define DIGITAL_PIN_45		PORT_14	/* P141	*/
#define DIGITAL_PIN_46		PORT_14	/* P140	*/

/* For SDAA0,SCLA0 */
#define DIGITAL_PIN_47		PORT_6	/* P60	*/
#define DIGITAL_PIN_48		PORT_6	/* P61	*/
/* For SDAA1,SCLA1 */
#define DIGITAL_PIN_49		PORT_6	/* P62	*/
#define DIGITAL_PIN_50		PORT_6	/* P63	*/

/* For A0-A5 */
#define DIGITAL_PIN_51		PORT_2	/* P22	*/
#define DIGITAL_PIN_52		PORT_2	/* P23	*/
#define DIGITAL_PIN_53		PORT_2	/* P24	*/
#define DIGITAL_PIN_54		PORT_2	/* P25	*/
#define DIGITAL_PIN_55		PORT_2	/* P26	*/
#define DIGITAL_PIN_56		PORT_2	/* P27	*/
/* For A0-A6 */


/* Bit Num of digital pin define */
#define DIGITAL_PIN_BIT_0	0x03	/* P03	*/
#define DIGITAL_PIN_BIT_1	0x02	/* P02	*/
#define DIGITAL_PIN_BIT_2	0x03	/* P43	*/
#define DIGITAL_PIN_BIT_3	0x02	/* P42	*/
#define DIGITAL_PIN_BIT_4	0x07	/* P77	*/
#define DIGITAL_PIN_BIT_5	0x01	/* P41	*/
#define DIGITAL_PIN_BIT_6	0x01	/* P31	*/
#define DIGITAL_PIN_BIT_7	0x06	/* P76	*/
#define DIGITAL_PIN_BIT_8	0x03	/* P73	*/
#define DIGITAL_PIN_BIT_9	0x06	/* P06	*/
#define DIGITAL_PIN_BIT_10	0x05	/* P05	*/
#define DIGITAL_PIN_BIT_11	0x01	/* P51	*/
#define DIGITAL_PIN_BIT_12	0x00	/* P50	*/
#define DIGITAL_PIN_BIT_13	0x00	/* P30	*/
#define DIGITAL_PIN_BIT_14	0x00	/* P40(REF)	*/ // P20->P40
#define DIGITAL_PIN_BIT_15	0x02	/* P52	*/
#define DIGITAL_PIN_BIT_16	0x03	/* P53	*/
#define DIGITAL_PIN_BIT_17	0x04	/* P54	*/
#define DIGITAL_PIN_BIT_18	0x05	/* P55	*/
#define DIGITAL_PIN_BIT_19	0x00	/* P70	*/
#define DIGITAL_PIN_BIT_20	0x01	/* P71	*/
#define DIGITAL_PIN_BIT_21	0x02	/* P72	*/
#define DIGITAL_PIN_BIT_22	0x04	/* P74	*/
#define DIGITAL_PIN_BIT_23	0x05	/* P75	*/
#define DIGITAL_PIN_BIT_24	0x01	/* P121	*/
#define DIGITAL_PIN_BIT_25	0x02	/* P122	*/
#define DIGITAL_PIN_BIT_26	0x07	/* P137	*/
#define DIGITAL_PIN_BIT_27	0x03	/* P123	*/
#define DIGITAL_PIN_BIT_28	0x04	/* P124	*/
#define DIGITAL_PIN_BIT_29	0x00	/* P120	*/
#define DIGITAL_PIN_BIT_30	0x04	/* P04 	*/

#define DIGITAL_PIN_BIT_31	0x07	/* P17	*/
#define DIGITAL_PIN_BIT_32	0x06	/* P16	*/
#define DIGITAL_PIN_BIT_33	0x05	/* P15	*/
#define DIGITAL_PIN_BIT_34	0x04	/* P14	*/
#define DIGITAL_PIN_BIT_35	0x03	/* P13	*/
#define DIGITAL_PIN_BIT_36	0x02	/* P12	*/
#define DIGITAL_PIN_BIT_37	0x01	/* P11	*/
#define DIGITAL_PIN_BIT_38	0x00	/* P10	*/
#define DIGITAL_PIN_BIT_39	0x06	/* P146	*/
#define DIGITAL_PIN_BIT_40	0x07	/* P147	*/
#define DIGITAL_PIN_BIT_41	0x01	/* P21 	*/
#define DIGITAL_PIN_BIT_42	0x00	/* P130	*/
#define DIGITAL_PIN_BIT_43	0x01	/* P01 	*/
#define DIGITAL_PIN_BIT_44	0x00	/* P00 	*/
#define DIGITAL_PIN_BIT_45	0x01	/* P141	*/
#define DIGITAL_PIN_BIT_46	0x00	/* P140	*/
                                
/* For SDAA0,SCLA0 */           
#define DIGITAL_PIN_BIT_47	0x00	/* P60	*/
#define DIGITAL_PIN_BIT_48	0x01	/* P61	*/
/* For SDAA1,SCLA1 */           
#define DIGITAL_PIN_BIT_49	0x02	/* P62	*/
#define DIGITAL_PIN_BIT_50	0x03	/* P63	*/

/* For A0-A5 */
#define DIGITAL_PIN_BIT_51	0x02	/* P22	*/
#define DIGITAL_PIN_BIT_52	0x03	/* P23	*/
#define DIGITAL_PIN_BIT_53	0x04	/* P24	*/
#define DIGITAL_PIN_BIT_54	0x05	/* P25	*/
#define DIGITAL_PIN_BIT_55	0x06	/* P26	*/
#define DIGITAL_PIN_BIT_56	0x07	/* P27	*/
/* For A0-A6 */

/* Bit mask of digital pin define. */
#define DIGITAL_PIN_MASK_0		0x08	/* P03	*/
#define DIGITAL_PIN_MASK_1		0x04	/* P02	*/
#define DIGITAL_PIN_MASK_2		0x08	/* P43	*/
#define DIGITAL_PIN_MASK_3		0x04	/* P42	*/
#define DIGITAL_PIN_MASK_4		0x80	/* P77	*/
#define DIGITAL_PIN_MASK_5		0x02	/* P41	*/
#define DIGITAL_PIN_MASK_6		0x02	/* P31	*/
#define DIGITAL_PIN_MASK_7		0x40	/* P76	*/
#define DIGITAL_PIN_MASK_8		0x08	/* P73	*/
#define DIGITAL_PIN_MASK_9		0x40	/* P06	*/
#define DIGITAL_PIN_MASK_10		0x20	/* P05	*/
#define DIGITAL_PIN_MASK_11		0x02	/* P51	*/
#define DIGITAL_PIN_MASK_12		0x01	/* P50	*/
#define DIGITAL_PIN_MASK_13		0x01	/* P30	*/
#define DIGITAL_PIN_MASK_14		0x01	/* P40(REF)	*/  // P20->P40
#define DIGITAL_PIN_MASK_15		0x04	/* P52	*/
#define DIGITAL_PIN_MASK_16		0x08	/* P53	*/
#define DIGITAL_PIN_MASK_17		0x10	/* P54	*/
#define DIGITAL_PIN_MASK_18		0x20	/* P55	*/
#define DIGITAL_PIN_MASK_19		0x01	/* P70	*/
#define DIGITAL_PIN_MASK_20		0x02	/* P71	*/
#define DIGITAL_PIN_MASK_21		0x04	/* P72	*/
#define DIGITAL_PIN_MASK_22		0x10	/* P74	*/
#define DIGITAL_PIN_MASK_23		0x20	/* P75	*/
#define DIGITAL_PIN_MASK_24		0x02	/* P121	*/
#define DIGITAL_PIN_MASK_25		0x04	/* P122	*/
#define DIGITAL_PIN_MASK_26		0x80	/* P137	*/
#define DIGITAL_PIN_MASK_27		0x08	/* P123	*/
#define DIGITAL_PIN_MASK_28		0x10	/* P124	*/
#define DIGITAL_PIN_MASK_29		0x01	/* P120	*/
#define DIGITAL_PIN_MASK_30		0x10	/* P04 	*/
                                        
#define DIGITAL_PIN_MASK_31		0x80	/* P17	*/
#define DIGITAL_PIN_MASK_32		0x40	/* P16	*/
#define DIGITAL_PIN_MASK_33		0x20	/* P15	*/
#define DIGITAL_PIN_MASK_34		0x10	/* P14	*/
#define DIGITAL_PIN_MASK_35		0x08 	/* P13	*/
#define DIGITAL_PIN_MASK_36		0x04	/* P12	*/
#define DIGITAL_PIN_MASK_37		0x02	/* P11	*/
#define DIGITAL_PIN_MASK_38		0x01	/* P10	*/
#define DIGITAL_PIN_MASK_39		0x40	/* P146	*/
#define DIGITAL_PIN_MASK_40		0x80	/* P147	*/
#define DIGITAL_PIN_MASK_41		0x02	/* P21 	*/
#define DIGITAL_PIN_MASK_42		0x01	/* P130	*/
#define DIGITAL_PIN_MASK_43		0x02	/* P01 	*/
#define DIGITAL_PIN_MASK_44		0x01	/* P00 	*/
#define DIGITAL_PIN_MASK_45		0x02	/* P141	*/
#define DIGITAL_PIN_MASK_46		0x01	/* P140	*/
                                        
/* For SDAA0,SCLA0 */                   
#define DIGITAL_PIN_MASK_47		0x01	/* P60	*/
#define DIGITAL_PIN_MASK_48		0x02	/* P61	*/
/* For SDAA1,SCLA1 */                   
#define DIGITAL_PIN_MASK_49		0x04	/* P62	*/
#define DIGITAL_PIN_MASK_50		0x08	/* P63	*/

