renesas/ArduinoCore-rl78g23_fpb_64p/variants/g23-fpb-64p/variant.h
/* For A0-A5 */
#define DIGITAL_PIN_MASK_51		0x04	/* P22	*/
#define DIGITAL_PIN_MASK_52		0x08	/* P23	*/
#define DIGITAL_PIN_MASK_53		0x10	/* P24	*/
#define DIGITAL_PIN_MASK_54		0x20	/* P25	*/
#define DIGITAL_PIN_MASK_55		0x40	/* P26	*/
#define DIGITAL_PIN_MASK_56		0x80	/* P27	*/
/* For A0-A6 */

/* Add for G23 PMCA & PMCT & PMCE */
#define DIGITAL_PIN_PMCA_0		0x08	/* P03	*/
#define DIGITAL_PIN_PMCA_1		0x04	/* P02	*/
#define DIGITAL_PIN_PMCA_2		0x00	/* P43	*/
#define DIGITAL_PIN_PMCA_3		0x00	/* P42	*/
#define DIGITAL_PIN_PMCA_4		0x00	/* P77	*/
#define DIGITAL_PIN_PMCA_5		0x00	/* P41	*/
#define DIGITAL_PIN_PMCA_6		0x00	/* P31	*/
#define DIGITAL_PIN_PMCA_7		0x00	/* P76	*/
#define DIGITAL_PIN_PMCA_8		0x00	/* P73	*/
#define DIGITAL_PIN_PMCA_9		0x00	/* P06	*/
#define DIGITAL_PIN_PMCA_10		0x00	/* P05	*/
#define DIGITAL_PIN_PMCA_11		0x00	/* P51	*/
#define DIGITAL_PIN_PMCA_12		0x00	/* P50	*/
#define DIGITAL_PIN_PMCA_13		0x00	/* P30	*/
#define DIGITAL_PIN_PMCA_14		0x01	/* P20(REF)	*/
#define DIGITAL_PIN_PMCA_15		0x00	/* P52	*/
#define DIGITAL_PIN_PMCA_16		0x00	/* P53	*/
#define DIGITAL_PIN_PMCA_17		0x00	/* P54	*/
#define DIGITAL_PIN_PMCA_18		0x00	/* P55	*/
#define DIGITAL_PIN_PMCA_19		0x00	/* P70	*/
#define DIGITAL_PIN_PMCA_20		0x00	/* P71	*/
#define DIGITAL_PIN_PMCA_21		0x00	/* P72	*/
#define DIGITAL_PIN_PMCA_22		0x00	/* P74	*/
#define DIGITAL_PIN_PMCA_23		0x00	/* P75	*/
#define DIGITAL_PIN_PMCA_24		0x00	/* P121	*/
#define DIGITAL_PIN_PMCA_25		0x00	/* P122	*/
#define DIGITAL_PIN_PMCA_26		0x00	/* P137	*/
#define DIGITAL_PIN_PMCA_27		0x00	/* P123	*/
#define DIGITAL_PIN_PMCA_28		0x00	/* P124	*/
#define DIGITAL_PIN_PMCA_29		0x01	/* P120	*/
#define DIGITAL_PIN_PMCA_30		0x00	/* P04 	*/
#define DIGITAL_PIN_PMCA_31		0x00	/* P17	*/
#define DIGITAL_PIN_PMCA_32		0x00	/* P16	*/
#define DIGITAL_PIN_PMCA_33		0x00	/* P15	*/
#define DIGITAL_PIN_PMCA_34		0x00	/* P14	*/
#define DIGITAL_PIN_PMCA_35		0x08 	/* P13	*/
#define DIGITAL_PIN_PMCA_36		0x00	/* P12	*/
#define DIGITAL_PIN_PMCA_37		0x00	/* P11	*/
#define DIGITAL_PIN_PMCA_38		0x00	/* P10	*/
#define DIGITAL_PIN_PMCA_39		0x00	/* P146	*/
#define DIGITAL_PIN_PMCA_40		0x80	/* P147	*/
#define DIGITAL_PIN_PMCA_41		0x02	/* P21 	*/
#define DIGITAL_PIN_PMCA_42		0x00	/* P130	*/
#define DIGITAL_PIN_PMCA_43		0x00	/* P01 	*/
#define DIGITAL_PIN_PMCA_44		0x00	/* P00 	*/
#define DIGITAL_PIN_PMCA_45		0x00	/* P141	*/
#define DIGITAL_PIN_PMCA_46		0x00	/* P140	*/
#define DIGITAL_PIN_PMCA_47		0x00	/* P60	*/
#define DIGITAL_PIN_PMCA_48		0x00	/* P61	*/
#define DIGITAL_PIN_PMCA_49		0x00	/* P62	*/
#define DIGITAL_PIN_PMCA_50		0x00	/* P63	*/

/* For A0-A5 */
#define DIGITAL_PIN_PMCA_51		0x04	/* P22	*/
#define DIGITAL_PIN_PMCA_52		0x08	/* P23	*/
#define DIGITAL_PIN_PMCA_53		0x10	/* P24	*/
#define DIGITAL_PIN_PMCA_54		0x20	/* P25	*/
#define DIGITAL_PIN_PMCA_55		0x40	/* P26	*/
#define DIGITAL_PIN_PMCA_56		0x80	/* P27	*/
/* For A0-A6 */

#define DIGITAL_PIN_PMCT_0		0x00	/* P03	*/
#define DIGITAL_PIN_PMCT_1		0x00	/* P02	*/
#define DIGITAL_PIN_PMCT_2		0x00	/* P43	*/
#define DIGITAL_PIN_PMCT_3		0x00	/* P42	*/
#define DIGITAL_PIN_PMCT_4		0x80	/* P77	*/
#define DIGITAL_PIN_PMCT_5		0x00	/* P41	*/
#define DIGITAL_PIN_PMCT_6		0x02	/* P31	*/
#define DIGITAL_PIN_PMCT_7		0x40	/* P76	*/
#define DIGITAL_PIN_PMCT_8		0x08	/* P73	*/
#define DIGITAL_PIN_PMCT_9		0x40	/* P06	*/
#define DIGITAL_PIN_PMCT_10		0x20	/* P05	*/
#define DIGITAL_PIN_PMCT_11		0x00	/* P51	*/
#define DIGITAL_PIN_PMCT_12		0x01	/* P50	*/
#define DIGITAL_PIN_PMCT_13		0x01	/* P30	*/
#define DIGITAL_PIN_PMCT_14		0x00	/* P20(REF)	*/
#define DIGITAL_PIN_PMCT_15		0x00	/* P52	*/
#define DIGITAL_PIN_PMCT_16		0x00	/* P53	*/
#define DIGITAL_PIN_PMCT_17		0x00	/* P54	*/
#define DIGITAL_PIN_PMCT_18		0x00	/* P55	*/
#define DIGITAL_PIN_PMCT_19		0x01	/* P70	*/
#define DIGITAL_PIN_PMCT_20		0x02	/* P71	*/
#define DIGITAL_PIN_PMCT_21		0x04	/* P72	*/
#define DIGITAL_PIN_PMCT_22		0x10	/* P74	*/
#define DIGITAL_PIN_PMCT_23		0x20	/* P75	*/
#define DIGITAL_PIN_PMCT_24		0x00	/* P121	*/
#define DIGITAL_PIN_PMCT_25		0x00	/* P122	*/
#define DIGITAL_PIN_PMCT_26		0x00	/* P137	*/
#define DIGITAL_PIN_PMCT_27		0x00	/* P123	*/
#define DIGITAL_PIN_PMCT_28		0x00	/* P124	*/
#define DIGITAL_PIN_PMCT_29		0x00	/* P120	*/
#define DIGITAL_PIN_PMCT_30		0x00	/* P04 	*/
#define DIGITAL_PIN_PMCT_31		0x00	/* P17	*/
#define DIGITAL_PIN_PMCT_32		0x00	/* P16	*/
#define DIGITAL_PIN_PMCT_33		0x00	/* P15	*/
#define DIGITAL_PIN_PMCT_34		0x00	/* P14	*/
#define DIGITAL_PIN_PMCT_35		0x00 	/* P13	*/
#define DIGITAL_PIN_PMCT_36		0x00	/* P12	*/
#define DIGITAL_PIN_PMCT_37		0x00	/* P11	*/
#define DIGITAL_PIN_PMCT_38		0x00	/* P10	*/
#define DIGITAL_PIN_PMCT_39		0x00	/* P146	*/
#define DIGITAL_PIN_PMCT_40		0x00	/* P147	*/
#define DIGITAL_PIN_PMCT_41		0x00	/* P21 	*/
#define DIGITAL_PIN_PMCT_42		0x00	/* P130	*/
#define DIGITAL_PIN_PMCT_43		0x00	/* P01 	*/
#define DIGITAL_PIN_PMCT_44		0x00	/* P00 	*/
#define DIGITAL_PIN_PMCT_45		0x00	/* P141	*/
#define DIGITAL_PIN_PMCT_46		0x00	/* P140	*/
#define DIGITAL_PIN_PMCT_47		0x00	/* P60	*/
#define DIGITAL_PIN_PMCT_48		0x00	/* P61	*/
#define DIGITAL_PIN_PMCT_49		0x00	/* P62	*/
#define DIGITAL_PIN_PMCT_50		0x00	/* P63	*/

/* For A0-A5 */
#define DIGITAL_PIN_PMCT_51		0x04	/* P22	*/
#define DIGITAL_PIN_PMCT_52		0x08	/* P23	*/
#define DIGITAL_PIN_PMCT_53		0x10	/* P24	*/
#define DIGITAL_PIN_PMCT_54		0x20	/* P25	*/
#define DIGITAL_PIN_PMCT_55		0x40	/* P26	*/
#define DIGITAL_PIN_PMCT_56		0x80	/* P27	*/
/* For A0-A6 */

#define DIGITAL_PIN_PMCE_0		0x00	/* P03	*/
#define DIGITAL_PIN_PMCE_1		0x00	/* P02	*/
#define DIGITAL_PIN_PMCE_2		0x00	/* P43	*/
#define DIGITAL_PIN_PMCE_3		0x00	/* P42	*/
#define DIGITAL_PIN_PMCE_4		0x00	/* P77	*/
#define DIGITAL_PIN_PMCE_5		0x00	/* P41	*/
#define DIGITAL_PIN_PMCE_6		0x00	/* P31	*/
#define DIGITAL_PIN_PMCE_7		0x00	/* P76	*/
#define DIGITAL_PIN_PMCE_8		0x00	/* P73	*/
#define DIGITAL_PIN_PMCE_9		0x00	/* P06	*/
#define DIGITAL_PIN_PMCE_10		0x00	/* P05	*/
#define DIGITAL_PIN_PMCE_11		0x02	/* P51	*/
#define DIGITAL_PIN_PMCE_12		0x01	/* P50	*/
#define DIGITAL_PIN_PMCE_13		0x00	/* P30	*/
#define DIGITAL_PIN_PMCE_14		0x00	/* P20(REF)	*/
#define DIGITAL_PIN_PMCE_15		0x00	/* P52	*/
#define DIGITAL_PIN_PMCE_16		0x00	/* P53	*/
#define DIGITAL_PIN_PMCE_17		0x00	/* P54	*/
#define DIGITAL_PIN_PMCE_18		0x00	/* P55	*/
#define DIGITAL_PIN_PMCE_19		0x00	/* P70	*/
#define DIGITAL_PIN_PMCE_20		0x00	/* P71	*/
#define DIGITAL_PIN_PMCE_21		0x00	/* P72	*/
#define DIGITAL_PIN_PMCE_22		0x00	/* P74	*/
#define DIGITAL_PIN_PMCE_23		0x00	/* P75	*/
#define DIGITAL_PIN_PMCE_24		0x00	/* P121	*/
#define DIGITAL_PIN_PMCE_25		0x00	/* P122	*/
#define DIGITAL_PIN_PMCE_26		0x00	/* P137	*/
#define DIGITAL_PIN_PMCE_27		0x00	/* P123	*/
#define DIGITAL_PIN_PMCE_28		0x00	/* P124	*/
#define DIGITAL_PIN_PMCE_29		0x00	/* P120	*/
#define DIGITAL_PIN_PMCE_30		0x00	/* P04 	*/
#define DIGITAL_PIN_PMCE_31		0x80	/* P17	*/
#define DIGITAL_PIN_PMCE_32		0x40	/* P16	*/
#define DIGITAL_PIN_PMCE_33		0x20	/* P15	*/
#define DIGITAL_PIN_PMCE_34		0x10	/* P14	*/
#define DIGITAL_PIN_PMCE_35		0x08 	/* P13	*/
#define DIGITAL_PIN_PMCE_36		0x04	/* P12	*/
#define DIGITAL_PIN_PMCE_37		0x02	/* P11	*/
#define DIGITAL_PIN_PMCE_38		0x01	/* P10	*/
#define DIGITAL_PIN_PMCE_39		0x00	/* P146	*/
#define DIGITAL_PIN_PMCE_40		0x00	/* P147	*/
#define DIGITAL_PIN_PMCE_41		0x00	/* P21 	*/
#define DIGITAL_PIN_PMCE_42		0x00	/* P130	*/
#define DIGITAL_PIN_PMCE_43		0x02	/* P01 	*/
#define DIGITAL_PIN_PMCE_44		0x00	/* P00 	*/
#define DIGITAL_PIN_PMCE_45		0x00	/* P141	*/
#define DIGITAL_PIN_PMCE_46		0x00	/* P140	*/
#define DIGITAL_PIN_PMCE_47		0x01	/* P60	*/
#define DIGITAL_PIN_PMCE_48		0x02	/* P61	*/
#define DIGITAL_PIN_PMCE_49		0x00	/* P62	*/
#define DIGITAL_PIN_PMCE_50		0x00	/* P63	*/

