renesas/ArduinoCore-rl78g23_fpb_64p/variants/g23-fpb-64p/variant.h
/* For A0-A5 */
#define DIGITAL_PIN_PMCE_51		0x00	/* P22	*/
#define DIGITAL_PIN_PMCE_52		0x00	/* P23	*/
#define DIGITAL_PIN_PMCE_53		0x00	/* P24	*/
#define DIGITAL_PIN_PMCE_54		0x00	/* P25	*/
#define DIGITAL_PIN_PMCE_55		0x00	/* P26	*/
#define DIGITAL_PIN_PMCE_56		0x00	/* P27	*/
/* For A0-A6 */

/* Define Digital Pin CCDE */
#define DIGITAL_PIN_CCDE_0		0x00	/* P03	*/
#define DIGITAL_PIN_CCDE_1		0x00	/* P02	*/
#define DIGITAL_PIN_CCDE_2		0x00	/* P43	*/
#define DIGITAL_PIN_CCDE_3		0x00	/* P42	*/
#define DIGITAL_PIN_CCDE_4		0x00	/* P77	*/
#define DIGITAL_PIN_CCDE_5		0x00	/* P41	*/
#define DIGITAL_PIN_CCDE_6		0x00	/* P31	*/
#define DIGITAL_PIN_CCDE_7		0x00	/* P76	*/
#define DIGITAL_PIN_CCDE_8		0x00	/* P73	*/
#define DIGITAL_PIN_CCDE_9		0x00	/* P06	*/
#define DIGITAL_PIN_CCDE_10		0x00	/* P05	*/
#define DIGITAL_PIN_CCDE_11		0x04	/* P51	*/
#define DIGITAL_PIN_CCDE_12		0x08	/* P50	*/
#define DIGITAL_PIN_CCDE_13		0x00	/* P30	*/
#define DIGITAL_PIN_CCDE_14		0x00	/* P20(REF)	*/
#define DIGITAL_PIN_CCDE_15		0x00	/* P52	*/
#define DIGITAL_PIN_CCDE_16		0x00	/* P53	*/
#define DIGITAL_PIN_CCDE_17		0x00	/* P54	*/
#define DIGITAL_PIN_CCDE_18		0x00	/* P55	*/
#define DIGITAL_PIN_CCDE_19		0x00	/* P70	*/
#define DIGITAL_PIN_CCDE_20		0x00	/* P71	*/
#define DIGITAL_PIN_CCDE_21		0x00	/* P72	*/
#define DIGITAL_PIN_CCDE_22		0x00	/* P74	*/
#define DIGITAL_PIN_CCDE_23		0x00	/* P75	*/
#define DIGITAL_PIN_CCDE_24		0x00	/* P121	*/
#define DIGITAL_PIN_CCDE_25		0x00	/* P122	*/
#define DIGITAL_PIN_CCDE_26		0x00	/* P137	*/
#define DIGITAL_PIN_CCDE_27		0x00	/* P123	*/
#define DIGITAL_PIN_CCDE_28		0x00	/* P124	*/
#define DIGITAL_PIN_CCDE_29		0x00	/* P120	*/
#define DIGITAL_PIN_CCDE_30		0x00	/* P04 	*/
#define DIGITAL_PIN_CCDE_31		0x02	/* P17	*/
#define DIGITAL_PIN_CCDE_32		0x01	/* P16	*/
#define DIGITAL_PIN_CCDE_33		0x00	/* P15	*/
#define DIGITAL_PIN_CCDE_34		0x00	/* P14	*/
#define DIGITAL_PIN_CCDE_35		0x00 	/* P13	*/
#define DIGITAL_PIN_CCDE_36		0x00	/* P12	*/
#define DIGITAL_PIN_CCDE_37		0x00	/* P11	*/
#define DIGITAL_PIN_CCDE_38		0x00	/* P10	*/
#define DIGITAL_PIN_CCDE_39		0x00	/* P146	*/
#define DIGITAL_PIN_CCDE_40		0x00	/* P147	*/
#define DIGITAL_PIN_CCDE_41		0x00	/* P21 	*/
#define DIGITAL_PIN_CCDE_42		0x00	/* P130	*/
#define DIGITAL_PIN_CCDE_43		0x00	/* P01 	*/
#define DIGITAL_PIN_CCDE_44		0x00	/* P00 	*/
#define DIGITAL_PIN_CCDE_45		0x00	/* P141	*/
#define DIGITAL_PIN_CCDE_46		0x00	/* P140	*/
#define DIGITAL_PIN_CCDE_47		0x10	/* P60	*/
#define DIGITAL_PIN_CCDE_48		0x20	/* P61	*/
#define DIGITAL_PIN_CCDE_49		0x40	/* P62	*/
#define DIGITAL_PIN_CCDE_50		0x80	/* P63	*/

/* For A0-A5 */
#define DIGITAL_PIN_CCDE_51		0x00	/* P22	*/
#define DIGITAL_PIN_CCDE_52		0x00	/* P23	*/
#define DIGITAL_PIN_CCDE_53		0x00	/* P24	*/
#define DIGITAL_PIN_CCDE_54		0x00	/* P25	*/
#define DIGITAL_PIN_CCDE_55		0x00	/* P26	*/
#define DIGITAL_PIN_CCDE_56		0x00	/* P27	*/
/* For A0-A6 */

/* Define Digital Pin PDIDIS */
#define DIGITAL_PIN_PDIDIS_0	0x08	/* P03	*/
#define DIGITAL_PIN_PDIDIS_1	0x04	/* P02	*/
#define DIGITAL_PIN_PDIDIS_2	0x00	/* P43	*/
#define DIGITAL_PIN_PDIDIS_3	0x04	/* P42	*/
#define DIGITAL_PIN_PDIDIS_4	0x00	/* P77	*/
#define DIGITAL_PIN_PDIDIS_5	0x00	/* P41	*/
#define DIGITAL_PIN_PDIDIS_6	0x00	/* P31	*/
#define DIGITAL_PIN_PDIDIS_7	0x00	/* P76	*/
#define DIGITAL_PIN_PDIDIS_8	0x00	/* P73	*/
#define DIGITAL_PIN_PDIDIS_9	0x00	/* P06	*/
#define DIGITAL_PIN_PDIDIS_10	0x00	/* P05	*/
#define DIGITAL_PIN_PDIDIS_11	0x00	/* P51	*/
#define DIGITAL_PIN_PDIDIS_12	0x01	/* P50	*/
#define DIGITAL_PIN_PDIDIS_13	0x00	/* P30	*/
#define DIGITAL_PIN_PDIDIS_14	0x00	/* P20(REF)	*/
#define DIGITAL_PIN_PDIDIS_15	0x00	/* P52	*/
#define DIGITAL_PIN_PDIDIS_16	0x00	/* P53	*/
#define DIGITAL_PIN_PDIDIS_17	0x00	/* P54	*/
#define DIGITAL_PIN_PDIDIS_18	0x20	/* P55	*/
#define DIGITAL_PIN_PDIDIS_19	0x00	/* P70	*/
#define DIGITAL_PIN_PDIDIS_20	0x02	/* P71	*/
#define DIGITAL_PIN_PDIDIS_21	0x04	/* P72	*/
#define DIGITAL_PIN_PDIDIS_22	0x10	/* P74	*/
#define DIGITAL_PIN_PDIDIS_23	0x00	/* P75	*/
#define DIGITAL_PIN_PDIDIS_24	0x00	/* P121	*/
#define DIGITAL_PIN_PDIDIS_25	0x00	/* P122	*/
#define DIGITAL_PIN_PDIDIS_26	0x80	/* P137	*/
#define DIGITAL_PIN_PDIDIS_27	0x00	/* P123	*/
#define DIGITAL_PIN_PDIDIS_28	0x00	/* P124	*/
#define DIGITAL_PIN_PDIDIS_29	0x01	/* P120	*/
#define DIGITAL_PIN_PDIDIS_30	0x10	/* P04 	*/
#define DIGITAL_PIN_PDIDIS_31	0x80	/* P17	*/
#define DIGITAL_PIN_PDIDIS_32	0x00	/* P16	*/
#define DIGITAL_PIN_PDIDIS_33	0x20	/* P15	*/
#define DIGITAL_PIN_PDIDIS_34	0x10	/* P14	*/
#define DIGITAL_PIN_PDIDIS_35	0x08 	/* P13	*/
#define DIGITAL_PIN_PDIDIS_36	0x04	/* P12	*/
#define DIGITAL_PIN_PDIDIS_37	0x02	/* P11	*/
#define DIGITAL_PIN_PDIDIS_38	0x01	/* P10	*/
#define DIGITAL_PIN_PDIDIS_39	0x00	/* P146	*/
#define DIGITAL_PIN_PDIDIS_40	0x00	/* P147	*/
#define DIGITAL_PIN_PDIDIS_41	0x00	/* P21 	*/
#define DIGITAL_PIN_PDIDIS_42	0x00	/* P130	*/
#define DIGITAL_PIN_PDIDIS_43	0x00	/* P01 	*/
#define DIGITAL_PIN_PDIDIS_44	0x01	/* P00 	*/
#define DIGITAL_PIN_PDIDIS_45	0x00	/* P141	*/
#define DIGITAL_PIN_PDIDIS_46	0x00	/* P140	*/
#define DIGITAL_PIN_PDIDIS_47	0x00	/* P60	*/
#define DIGITAL_PIN_PDIDIS_48	0x00	/* P61	*/
#define DIGITAL_PIN_PDIDIS_49	0x00	/* P62	*/
#define DIGITAL_PIN_PDIDIS_50	0x00	/* P63	*/

/* For A0-A5 */
#define DIGITAL_PIN_PDIDIS_51	0x00	/* P22	*/
#define DIGITAL_PIN_PDIDIS_52	0x00	/* P23	*/
#define DIGITAL_PIN_PDIDIS_53	0x00	/* P24	*/
#define DIGITAL_PIN_PDIDIS_54	0x00	/* P25	*/
#define DIGITAL_PIN_PDIDIS_55	0x00	/* P26	*/
#define DIGITAL_PIN_PDIDIS_56	0x00	/* P27	*/
/* For A0-A6 */

/* Define Digital Pin PM */
#define DIGITAL_PIN_PM_0		0x08	/* P03	*/
#define DIGITAL_PIN_PM_1		0x04	/* P02	*/
#define DIGITAL_PIN_PM_2		0x08	/* P43	*/
#define DIGITAL_PIN_PM_3		0x04	/* P42	*/
#define DIGITAL_PIN_PM_4		0x80	/* P77	*/
#define DIGITAL_PIN_PM_5		0x02	/* P41	*/
#define DIGITAL_PIN_PM_6		0x02	/* P31	*/
#define DIGITAL_PIN_PM_7		0x40	/* P76	*/
#define DIGITAL_PIN_PM_8		0x08	/* P73	*/
#define DIGITAL_PIN_PM_9		0x40	/* P06	*/
#define DIGITAL_PIN_PM_10		0x20	/* P05	*/
#define DIGITAL_PIN_PM_11		0x02	/* P51	*/
#define DIGITAL_PIN_PM_12		0x01	/* P50	*/
#define DIGITAL_PIN_PM_13		0x01	/* P30	*/
#define DIGITAL_PIN_PM_14		0x01	/* P20(REF)	*/
#define DIGITAL_PIN_PM_15		0x04	/* P52	*/
#define DIGITAL_PIN_PM_16		0x08	/* P53	*/
#define DIGITAL_PIN_PM_17		0x10	/* P54	*/
#define DIGITAL_PIN_PM_18		0x20	/* P55	*/
#define DIGITAL_PIN_PM_19		0x01	/* P70	*/
#define DIGITAL_PIN_PM_20		0x02	/* P71	*/
#define DIGITAL_PIN_PM_21		0x04	/* P72	*/
#define DIGITAL_PIN_PM_22		0x10	/* P74	*/
#define DIGITAL_PIN_PM_23		0x20	/* P75	*/
#define DIGITAL_PIN_PM_24		0x02	/* P121	*/
#define DIGITAL_PIN_PM_25		0x04	/* P122	*/
#define DIGITAL_PIN_PM_26		0x00	/* P137	*/
#define DIGITAL_PIN_PM_27		0x00	/* P123	*/
#define DIGITAL_PIN_PM_28		0x00	/* P124	*/
#define DIGITAL_PIN_PM_29		0x01	/* P120	*/
#define DIGITAL_PIN_PM_30		0x10	/* P04 	*/
#define DIGITAL_PIN_PM_31		0x80	/* P17	*/
#define DIGITAL_PIN_PM_32		0x40	/* P16	*/
#define DIGITAL_PIN_PM_33		0x20	/* P15	*/
#define DIGITAL_PIN_PM_34		0x10	/* P14	*/
#define DIGITAL_PIN_PM_35		0x08 	/* P13	*/
#define DIGITAL_PIN_PM_36		0x04	/* P12	*/
#define DIGITAL_PIN_PM_37		0x02	/* P11	*/
#define DIGITAL_PIN_PM_38		0x01	/* P10	*/
#define DIGITAL_PIN_PM_39		0x40	/* P146	*/
#define DIGITAL_PIN_PM_40		0x80	/* P147	*/
#define DIGITAL_PIN_PM_41		0x02	/* P21 	*/
#define DIGITAL_PIN_PM_42		0x00	/* P130	*/
#define DIGITAL_PIN_PM_43		0x02	/* P01 	*/
#define DIGITAL_PIN_PM_44		0x01	/* P00 	*/
#define DIGITAL_PIN_PM_45		0x02	/* P141	*/
#define DIGITAL_PIN_PM_46		0x01	/* P140	*/
#define DIGITAL_PIN_PM_47		0x01	/* P60	*/
#define DIGITAL_PIN_PM_48		0x02	/* P61	*/
#define DIGITAL_PIN_PM_49		0x04	/* P62	*/
#define DIGITAL_PIN_PM_50		0x08	/* P63	*/

