renesas/ArduinoCore-rl78g23_fpb_64p/variants/g23-fpb-64p/variant.h
/* For A0-A5 */
#define DIGITAL_PIN_PM_51		0x04	/* P22	*/
#define DIGITAL_PIN_PM_52		0x08	/* P23	*/
#define DIGITAL_PIN_PM_53		0x10	/* P24	*/
#define DIGITAL_PIN_PM_54		0x20	/* P25	*/
#define DIGITAL_PIN_PM_55		0x40	/* P26	*/
#define DIGITAL_PIN_PM_56		0x80	/* P27	*/
/* For A0-A6 */

/* Define Digital Pin PU */
#define DIGITAL_PIN_PU_0		0x08	/* P03	*/
#define DIGITAL_PIN_PU_1		0x04	/* P02	*/
#define DIGITAL_PIN_PU_2		0x08	/* P43	*/
#define DIGITAL_PIN_PU_3		0x04	/* P42	*/
#define DIGITAL_PIN_PU_4		0x80	/* P77	*/
#define DIGITAL_PIN_PU_5		0x02	/* P41	*/
#define DIGITAL_PIN_PU_6		0x02	/* P31	*/
#define DIGITAL_PIN_PU_7		0x40	/* P76	*/
#define DIGITAL_PIN_PU_8		0x08	/* P73	*/
#define DIGITAL_PIN_PU_9		0x40	/* P06	*/
#define DIGITAL_PIN_PU_10		0x20	/* P05	*/
#define DIGITAL_PIN_PU_11		0x02	/* P51	*/
#define DIGITAL_PIN_PU_12		0x01	/* P50	*/
#define DIGITAL_PIN_PU_13		0x01	/* P30	*/
#define DIGITAL_PIN_PU_14		0x00	/* P20(REF)	*/
#define DIGITAL_PIN_PU_15		0x04	/* P52	*/
#define DIGITAL_PIN_PU_16		0x08	/* P53	*/
#define DIGITAL_PIN_PU_17		0x10	/* P54	*/
#define DIGITAL_PIN_PU_18		0x20	/* P55	*/
#define DIGITAL_PIN_PU_19		0x01	/* P70	*/
#define DIGITAL_PIN_PU_20		0x02	/* P71	*/
#define DIGITAL_PIN_PU_21		0x04	/* P72	*/
#define DIGITAL_PIN_PU_22		0x10	/* P74	*/
#define DIGITAL_PIN_PU_23		0x20	/* P75	*/
#define DIGITAL_PIN_PU_24		0x02	/* P121	*/
#define DIGITAL_PIN_PU_25		0x04	/* P122	*/
#define DIGITAL_PIN_PU_26		0x00	/* P137	*/
#define DIGITAL_PIN_PU_27		0x00	/* P123	*/
#define DIGITAL_PIN_PU_28		0x00	/* P124	*/
#define DIGITAL_PIN_PU_29		0x01	/* P120	*/
#define DIGITAL_PIN_PU_30		0x10	/* P04 	*/
#define DIGITAL_PIN_PU_31		0x80	/* P17	*/
#define DIGITAL_PIN_PU_32		0x40	/* P16	*/
#define DIGITAL_PIN_PU_33		0x20	/* P15	*/
#define DIGITAL_PIN_PU_34		0x10	/* P14	*/
#define DIGITAL_PIN_PU_35		0x08 	/* P13	*/
#define DIGITAL_PIN_PU_36		0x04	/* P12	*/
#define DIGITAL_PIN_PU_37		0x02	/* P11	*/
#define DIGITAL_PIN_PU_38		0x01	/* P10	*/
#define DIGITAL_PIN_PU_39		0x40	/* P146	*/
#define DIGITAL_PIN_PU_40		0x80	/* P147	*/
#define DIGITAL_PIN_PU_41		0x00	/* P21 	*/
#define DIGITAL_PIN_PU_42		0x00	/* P130	*/
#define DIGITAL_PIN_PU_43		0x02	/* P01 	*/
#define DIGITAL_PIN_PU_44		0x01	/* P00 	*/
#define DIGITAL_PIN_PU_45		0x02	/* P141	*/
#define DIGITAL_PIN_PU_46		0x01	/* P140	*/
#define DIGITAL_PIN_PU_47		0x00	/* P60	*/
#define DIGITAL_PIN_PU_48		0x00	/* P61	*/
#define DIGITAL_PIN_PU_49		0x00	/* P62	*/
#define DIGITAL_PIN_PU_50		0x00	/* P63	*/

/* For A0-A5 */
#define DIGITAL_PIN_PU_51		0x00	/* P22	*/
#define DIGITAL_PIN_PU_52		0x00	/* P23	*/
#define DIGITAL_PIN_PU_53		0x00	/* P24	*/
#define DIGITAL_PIN_PU_54		0x00	/* P25	*/
#define DIGITAL_PIN_PU_55		0x00	/* P26	*/
#define DIGITAL_PIN_PU_56		0x00	/* P27	*/
/* For A0-A6 */

/* Define Digital Pin PIM */
#define DIGITAL_PIN_PIM_0		0x08	/* P03	*/
#define DIGITAL_PIN_PIM_1		0x00	/* P02	*/
#define DIGITAL_PIN_PIM_2		0x00	/* P43	*/
#define DIGITAL_PIN_PIM_3		0x00	/* P42	*/
#define DIGITAL_PIN_PIM_4		0x00	/* P77	*/
#define DIGITAL_PIN_PIM_5		0x02	/* P41	*/
#define DIGITAL_PIN_PIM_6		0x00	/* P31	*/
#define DIGITAL_PIN_PIM_7		0x00	/* P76	*/
#define DIGITAL_PIN_PIM_8		0x00	/* P73	*/
#define DIGITAL_PIN_PIM_9		0x00	/* P06	*/
#define DIGITAL_PIN_PIM_10		0x00	/* P05	*/
#define DIGITAL_PIN_PIM_11		0x00	/* P51	*/
#define DIGITAL_PIN_PIM_12		0x00	/* P50	*/
#define DIGITAL_PIN_PIM_13		0x00	/* P30	*/
#define DIGITAL_PIN_PIM_14		0x00	/* P20(REF)	*/
#define DIGITAL_PIN_PIM_15		0x00	/* P52	*/
#define DIGITAL_PIN_PIM_16		0x00	/* P53	*/
#define DIGITAL_PIN_PIM_17		0x00	/* P54	*/
#define DIGITAL_PIN_PIM_18		0x20	/* P55	*/
#define DIGITAL_PIN_PIM_19		0x00	/* P70	*/
#define DIGITAL_PIN_PIM_20		0x02	/* P71	*/
#define DIGITAL_PIN_PIM_21		0x00	/* P72	*/
#define DIGITAL_PIN_PIM_22		0x00	/* P74	*/
#define DIGITAL_PIN_PIM_23		0x00	/* P75	*/
#define DIGITAL_PIN_PIM_24		0x00	/* P121	*/
#define DIGITAL_PIN_PIM_25		0x00	/* P122	*/
#define DIGITAL_PIN_PIM_26		0x00	/* P137	*/
#define DIGITAL_PIN_PIM_27		0x00	/* P123	*/
#define DIGITAL_PIN_PIM_28		0x00	/* P124	*/
#define DIGITAL_PIN_PIM_29		0x00	/* P120	*/
#define DIGITAL_PIN_PIM_30		0x10	/* P04 	*/
#define DIGITAL_PIN_PIM_31		0x80	/* P17	*/
#define DIGITAL_PIN_PIM_32		0x40	/* P16	*/
#define DIGITAL_PIN_PIM_33		0x20	/* P15	*/
#define DIGITAL_PIN_PIM_34		0x10	/* P14	*/
#define DIGITAL_PIN_PIM_35		0x08 	/* P13	*/
#define DIGITAL_PIN_PIM_36		0x00	/* P12	*/
#define DIGITAL_PIN_PIM_37		0x02	/* P11	*/
#define DIGITAL_PIN_PIM_38		0x01	/* P10	*/
#define DIGITAL_PIN_PIM_39		0x00	/* P146	*/
#define DIGITAL_PIN_PIM_40		0x00	/* P147	*/
#define DIGITAL_PIN_PIM_41		0x00	/* P21 	*/
#define DIGITAL_PIN_PIM_42		0x00	/* P130	*/
#define DIGITAL_PIN_PIM_43		0x02	/* P01 	*/
#define DIGITAL_PIN_PIM_44		0x00	/* P00 	*/
#define DIGITAL_PIN_PIM_45		0x00	/* P141	*/
#define DIGITAL_PIN_PIM_46		0x00	/* P140	*/
#define DIGITAL_PIN_PIM_47		0x00	/* P60	*/
#define DIGITAL_PIN_PIM_48		0x00	/* P61	*/
#define DIGITAL_PIN_PIM_49		0x00	/* P62	*/
#define DIGITAL_PIN_PIM_50		0x00	/* P63	*/

/* For A0-A5 */
#define DIGITAL_PIN_PIM_51		0x00	/* P22	*/
#define DIGITAL_PIN_PIM_52		0x00	/* P23	*/
#define DIGITAL_PIN_PIM_53		0x00	/* P24	*/
#define DIGITAL_PIN_PIM_54		0x00	/* P25	*/
#define DIGITAL_PIN_PIM_55		0x00	/* P26	*/
#define DIGITAL_PIN_PIM_56		0x00	/* P27	*/
/* For A0-A6 */

/* Define Digital Pin POM */
#define DIGITAL_PIN_POM_0		0x08	/* P03	*/
#define DIGITAL_PIN_POM_1		0x04	/* P02	*/
#define DIGITAL_PIN_POM_2		0x00	/* P43	*/
#define DIGITAL_PIN_POM_3		0x04	/* P42	*/
#define DIGITAL_PIN_POM_4		0x00	/* P77	*/
#define DIGITAL_PIN_POM_5		0x00	/* P41	*/
#define DIGITAL_PIN_POM_6		0x00	/* P31	*/
#define DIGITAL_PIN_POM_7		0x00	/* P76	*/
#define DIGITAL_PIN_POM_8		0x00	/* P73	*/
#define DIGITAL_PIN_POM_9		0x00	/* P06	*/
#define DIGITAL_PIN_POM_10		0x00	/* P05	*/
#define DIGITAL_PIN_POM_11		0x00	/* P51	*/
#define DIGITAL_PIN_POM_12		0x01	/* P50	*/
#define DIGITAL_PIN_POM_13		0x00	/* P30	*/
#define DIGITAL_PIN_POM_14		0x00	/* P20(REF)	*/
#define DIGITAL_PIN_POM_15		0x00	/* P52	*/
#define DIGITAL_PIN_POM_16		0x00	/* P53	*/
#define DIGITAL_PIN_POM_17		0x00	/* P54	*/
#define DIGITAL_PIN_POM_18		0x20	/* P55	*/
#define DIGITAL_PIN_POM_19		0x00	/* P70	*/
#define DIGITAL_PIN_POM_20		0x02	/* P71	*/
#define DIGITAL_PIN_POM_21		0x04	/* P72	*/
#define DIGITAL_PIN_POM_22		0x10	/* P74	*/
#define DIGITAL_PIN_POM_23		0x00	/* P75	*/
#define DIGITAL_PIN_POM_24		0x00	/* P121	*/
#define DIGITAL_PIN_POM_25		0x00	/* P122	*/
#define DIGITAL_PIN_POM_26		0x00	/* P137	*/
#define DIGITAL_PIN_POM_27		0x00	/* P123	*/
#define DIGITAL_PIN_POM_28		0x00	/* P124	*/
#define DIGITAL_PIN_POM_29		0x01	/* P120	*/
#define DIGITAL_PIN_POM_30		0x10	/* P04 	*/
#define DIGITAL_PIN_POM_31		0x80	/* P17	*/
#define DIGITAL_PIN_POM_32		0x00	/* P16	*/
#define DIGITAL_PIN_POM_33		0x20	/* P15	*/
#define DIGITAL_PIN_POM_34		0x10	/* P14	*/
#define DIGITAL_PIN_POM_35		0x08 	/* P13	*/
#define DIGITAL_PIN_POM_36		0x04	/* P12	*/
#define DIGITAL_PIN_POM_37		0x02	/* P11	*/
#define DIGITAL_PIN_POM_38		0x01	/* P10	*/
#define DIGITAL_PIN_POM_39		0x00	/* P146	*/
#define DIGITAL_PIN_POM_40		0x00	/* P147	*/
#define DIGITAL_PIN_POM_41		0x00	/* P21 	*/
#define DIGITAL_PIN_POM_42		0x00	/* P130	*/
#define DIGITAL_PIN_POM_43		0x00	/* P01 	*/
#define DIGITAL_PIN_POM_44		0x01	/* P00 	*/
#define DIGITAL_PIN_POM_45		0x00	/* P141	*/
#define DIGITAL_PIN_POM_46		0x00	/* P140	*/
#define DIGITAL_PIN_POM_47		0x00	/* P60	*/
#define DIGITAL_PIN_POM_48		0x00	/* P61	*/
#define DIGITAL_PIN_POM_49		0x00	/* P62	*/
#define DIGITAL_PIN_POM_50		0x00	/* P63	*/

