renesas/ArduinoCore-rl78g23_fpb_64p/variants/g23-fpb-64p/variant.h
/* For A0-A5 */
#define DIGITAL_PIN_POM_51		0x00	/* P22	*/
#define DIGITAL_PIN_POM_52		0x00	/* P23	*/
#define DIGITAL_PIN_POM_53		0x00	/* P24	*/
#define DIGITAL_PIN_POM_54		0x00	/* P25	*/
#define DIGITAL_PIN_POM_55		0x00	/* P26	*/
#define DIGITAL_PIN_POM_56		0x00	/* P27	*/
/* For A0-A6 */

///* Bit mask of digital pin define. */
//#define DIGITAL_PIN_MASK_0	0x02	// P11
//#define DIGITAL_PIN_MASK_1	0x04	// P12
//#define DIGITAL_PIN_MASK_2	0x01	// P30
//#define DIGITAL_PIN_MASK_3	0x40	// P16
//#define DIGITAL_PIN_MASK_4	0x02	// P31
//#define DIGITAL_PIN_MASK_5	0x20	// P15
//#define DIGITAL_PIN_MASK_6	0x01	// P10
//#define DIGITAL_PIN_MASK_7	0x01	// P00
//#define DIGITAL_PIN_MASK_8	0x02	// P01
//#define DIGITAL_PIN_MASK_9	0x08	// P13
//#define DIGITAL_PIN_MASK_10	0x10	// P14
//#define DIGITAL_PIN_MASK_11	0x04	// P72
//#define DIGITAL_PIN_MASK_12	0x02	// P71
//#define DIGITAL_PIN_MASK_13	0x01	// P70
//#define DIGITAL_PIN_MASK_14	0x04	// P22
//#define DIGITAL_PIN_MASK_15	0x08	// P23
//#define DIGITAL_PIN_MASK_16	0x10	// P24
//#define DIGITAL_PIN_MASK_17	0x20	// P25
//#define DIGITAL_PIN_MASK_18	0x40	// P25
//#define DIGITAL_PIN_MASK_19	0x80	// P27
//#define DIGITAL_PIN_MASK_20	0x80	// P147
//#define DIGITAL_PIN_MASK_21	0x01	// P120
//#define DIGITAL_PIN_MASK_22	0x80	// P17
//#define DIGITAL_PIN_MASK_23	0x02	// P51
//#define DIGITAL_PIN_MASK_24	0x01	// P50
//#define DIGITAL_PIN_MASK_25	0x80	// P137
//#define DIGITAL_PIN_MASK_26	0x01	// P140
//#define DIGITAL_PIN_MASK_27	0x02	// P41
//#define DIGITAL_PIN_MASK_28	0x08	// P73
//#define DIGITAL_PIN_MASK_29	0x10	// P74
//#define DIGITAL_PIN_MASK_30	0x20	// P75
#endif

//#define PWM_PIN_3			1		// TO1
//#define PWM_PIN_5			2		// TO2
//#define PWM_PIN_6			7		// TO7
//#define PWM_PIN_9			4		// TO4
//#define PWM_PIN_10			3		// TO3
//#define PWM_PIN_11			0xE0	// Software PWM0
//#define PWM_PIN_22			0xE1	// Software PWM1
//#define PWM_PIN_23			0xE2	// Software PWM2
//#define PWM_PIN_24			0xE3	// Software PWM3

//#define PWM_PIN_3			1		// TO1
//#define PWM_PIN_5			2		// TO2
//#define PWM_PIN_6			7		// TO7
//#define PWM_PIN_9			4		// TO4
//#define PWM_PIN_10			3		// TO3
#define PWM_PIN_11			0xE0	// Software PWM0
#define PWM_PIN_22			0xE1	// Software PWM1
#define PWM_PIN_23			0xE2	// Software PWM2
#define PWM_PIN_24			0xE3	// Software PWM3

#define SWPWM_PIN			0xE0
/* 1006 Nhu add */
#define PWM_PIN_3			3		// TO4
#define PWM_PIN_5			5		// TO7
#define PWM_PIN_6			6		// TO3
#define PWM_PIN_9			9		// TO6
#define PWM_PIN_10			10		// TO5
#define PWM_PIN_31			31		// TO2
#define PWM_PIN_32			32		// TO1
/* 1006 Nhu add */
/* Define Serial Port Number */
#define SERIAL_TXD0			36 // P12
#define SERIAL_RXD0			37 // P11

#define SERIAL_TXD1			1  // P02
#define SERIAL_RXD1			0  // P03

#define SERIAL_TXD2			35 // P13
#define SERIAL_RXD2			34 // P14
/* Define Serial Port Number */


/* Define Firmata library */
#define TOTAL_ANALOG_PINS       NUM_ANALOG_INPUTS //6
#define TOTAL_PINS              NUM_DIGITAL_PINS // 14 digital + 6 analog + 6 reserved + 10 internal used + 2 I2C + 3 SPI
#define TOTAL_PORTS             15 //P00 - P147
#define VERSION_BLINK_PIN       BUILTIN_LED1
#define PIN_SERIAL0_RX          37
#define PIN_SERIAL0_TX          36
#define PIN_SERIAL1_RX          0
#define PIN_SERIAL1_TX          1
#define PIN_SERIAL2_RX          34
#define PIN_SERIAL2_TX          35
// 2023/02/20
#if defined(UART_CHANNEL)
#define IS_PIN_SERIAL0(p)        ((p) == PIN_SERIAL0_RX || (p) == PIN_SERIAL0_TX )
#else
#define IS_PIN_SERIAL0(p)        (0)
#endif

#if defined(UART1_CHANNEL)
#define IS_PIN_SERIAL1(p)        ((p) == PIN_SERIAL1_RX || (p) == PIN_SERIAL1_TX)
#else
#define IS_PIN_SERIAL1(p)        (0)
#endif

#if defined(UART2_CHANNEL)
#define IS_PIN_SERIAL2(p)        ((p) == PIN_SERIAL2_RX || (p) == PIN_SERIAL2_TX)
#else
#define IS_PIN_SERIAL2(p)        (0)
#endif

// #define IS_PIN_SERIAL1(p)        (0)

// #define IS_PIN_SERIAL2(p)        ((p) == PIN_SERIAL2_RX || (p) == PIN_SERIAL2_TX)

#define IS_PIN_DIGITAL(p)       ((p) >= 0 && (p) < NUM_DIGITAL_PINS && (!(IS_PIN_SERIAL(p))))
#define IS_PIN_ANALOG(p)        ((p) >= 51 && (p) < 57)
#define IS_PIN_PWM(p)           digitalPinHasPWM(p)
#define IS_PIN_SERVO(p)         ((p) >= 0 && (p) < MAX_SERVOS)
#define IS_PIN_I2C(p)           ((p) == 47 || (p) == 48 || (p) == 49 || (p) == 50)
#define IS_PIN_SPI(p)           ((p) == SS || (p) == MOSI || (p) == MISO || (p) == SCK)
#define IS_PIN_SERIAL(p)        (IS_PIN_SERIAL0(p) || IS_PIN_SERIAL1(p) || IS_PIN_SERIAL2(p))
#define PIN_TO_DIGITAL(p)       (p)
#define PIN_TO_ANALOG(p)        ((p) - 51)
#define PIN_TO_PWM(p)           PIN_TO_DIGITAL(p)
#define PIN_TO_SERVO(p)         (p)
#define ANALOG_TO_PIN(p)        ((p) + 51)
/* Define Firmata library */

#endif // #variant
